fio/test.txt
To evaluate IO performance:

https://support.binarylane.com.au/support/solutions/articles/1000055889-how-to-benchmark-disk-i-o


# fio -name iops -rw=read -bs=4k -runtime=60 -iodepth 32 -filename /dev/nvme0n1 -ioengine libaio -direct=1
iops: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
fio-2.2.10
Starting 1 process
Jobs: 1 (f=1): [R(1)] [100.0% done] [823.4MB/0KB/0KB /s] [211K/0/0 iops] [eta 00m:00s]
iops: (groupid=0, jobs=1): err= 0: pid=1836: Sun Mar  3 22:36:56 2019
  read : io=49295MB, bw=841284KB/s, iops=210320, runt= 60001msec
    slat (usec): min=1, max=154, avg= 1.73, stdev= 0.95
    clat (usec): min=59, max=641, avg=150.09, stdev=27.51
     lat (usec): min=60, max=642, avg=151.86, stdev=27.46
    clat percentiles (usec):
     |  1.00th=[  101],  5.00th=[  110], 10.00th=[  119], 20.00th=[  123],
     | 30.00th=[  131], 40.00th=[  145], 50.00th=[  149], 60.00th=[  153],
     | 70.00th=[  163], 80.00th=[  179], 90.00th=[  185], 95.00th=[  189],
     | 99.00th=[  217], 99.50th=[  241], 99.90th=[  290], 99.95th=[  318],
     | 99.99th=[  402]
    bw (KB  /s): min=731048, max=1040992, per=99.95%, avg=840859.50, stdev=36362.89
    lat (usec) : 100=0.60%, 250=99.00%, 500=0.40%, 750=0.01%
  cpu          : usr=17.56%, sys=42.09%, ctx=2554138, majf=0, minf=42
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=12619470/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: io=49295MB, aggrb=841283KB/s, minb=841283KB/s, maxb=841283KB/s, mint=60001msec, maxt=60001msec

Disk stats (read/write):
  nvme0n1: ios=12600021/0, merge=0/0, ticks=1836060/0, in_queue=1780100, util=99.83%



# fio -name iops -rw=randrw -bs=4k -runtime=5 -iodepth 32 -filename /dev/nvme0n1 -ioengine libaio -direct=1
[sudo] password for zhang: 
iops: (g=0): rw=randrw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
fio-2.2.10
Starting 1 process
Jobs: 1 (f=1): [m(1)] [100.0% done] [83496KB/82688KB/0KB /s] [20.9K/20.7K/0 iops] [eta 00m:00s]
iops: (groupid=0, jobs=1): err= 0: pid=1865: Sun Mar  3 22:59:56 2019
  read : io=496664KB, bw=99253KB/s, iops=24813, runt=  5004msec
    slat (usec): min=2, max=46, avg= 4.34, stdev= 2.33
    clat (usec): min=110, max=8307, avg=1231.02, stdev=819.35
     lat (usec): min=113, max=8312, avg=1235.45, stdev=819.32
    clat percentiles (usec):
     |  1.00th=[  326],  5.00th=[  406], 10.00th=[  462], 20.00th=[  548],
     | 30.00th=[  684], 40.00th=[  844], 50.00th=[  972], 60.00th=[ 1112],
     | 70.00th=[ 1288], 80.00th=[ 2160], 90.00th=[ 2608], 95.00th=[ 2832],
     | 99.00th=[ 3376], 99.50th=[ 3600], 99.90th=[ 4048], 99.95th=[ 5664],
     | 99.99th=[ 7904]
    bw (KB  /s): min=80456, max=136936, per=100.00%, avg=99277.10, stdev=23147.36
  write: io=496172KB, bw=99155KB/s, iops=24788, runt=  5004msec
    slat (usec): min=3, max=51, avg= 4.62, stdev= 2.37
    clat (usec): min=8, max=3093, avg=47.01, stdev=41.47
     lat (usec): min=14, max=3097, avg=51.72, stdev=41.64
    clat percentiles (usec):
     |  1.00th=[   13],  5.00th=[   14], 10.00th=[   15], 20.00th=[   16],
     | 30.00th=[   19], 40.00th=[   24], 50.00th=[   32], 60.00th=[   43],
     | 70.00th=[   57], 80.00th=[   76], 90.00th=[  106], 95.00th=[  123],
     | 99.00th=[  155], 99.50th=[  167], 99.90th=[  197], 99.95th=[  229],
     | 99.99th=[  251]
    bw (KB  /s): min=80920, max=134824, per=100.00%, avg=99197.00, stdev=22999.69
    lat (usec) : 10=0.01%, 20=15.43%, 50=16.93%, 100=11.61%, 250=6.07%
    lat (usec) : 500=7.20%, 750=9.74%, 1000=9.02%
    lat (msec) : 2=13.59%, 4=10.34%, 10=0.05%
  cpu          : usr=11.19%, sys=26.96%, ctx=48906, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=124166/w=124043/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: io=496664KB, aggrb=99253KB/s, minb=99253KB/s, maxb=99253KB/s, mint=5004msec, maxt=5004msec
  WRITE: io=496172KB, aggrb=99155KB/s, minb=99155KB/s, maxb=99155KB/s, mint=5004msec, maxt=5004msec

Disk stats (read/write):
  nvme0n1: ios=121968/121834, merge=0/0, ticks=145672/2388, in_queue=143764, util=97.94%


# fio --name=io_uring_test --ioengine=io_uring --hipri --fixedbufs --iodepth=16 --direct=1 --numjobs=1 --filename=/dev/nvme0n1 --bs=4k --group_reporting --runtime=10
io_uring_test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=16
fio-3.13-27-gef32d
Starting 1 process
Jobs: 1 (f=1): [R(1)][100.0%][r=794MiB/s][r=203k IOPS][eta 00m:00s]
io_uring_test: (groupid=0, jobs=1): err= 0: pid=2483: Tue Apr  9 22:19:44 2019
  read: IOPS=139k, BW=544MiB/s (570MB/s)(5436MiB/10001msec)
    slat (nsec): min=928, max=29505, avg=1342.47, stdev=617.46
    clat (usec): min=20, max=1859, avg=113.37, stdev=91.59
     lat (usec): min=22, max=1860, avg=114.75, stdev=91.58
    clat percentiles (usec):
     |  1.00th=[   51],  5.00th=[   55], 10.00th=[   56], 20.00th=[   58],
     | 30.00th=[   60], 40.00th=[   61], 50.00th=[   65], 60.00th=[   78],
     | 70.00th=[  118], 80.00th=[  167], 90.00th=[  245], 95.00th=[  314],
     | 99.00th=[  449], 99.50th=[  502], 99.90th=[  611], 99.95th=[  660],
     | 99.99th=[  766]
   bw (  KiB/s): min=375608, max=811208, per=97.51%, avg=542795.00, stdev=196546.26, samples=19
   iops        : min=93902, max=202802, avg=135698.74, stdev=49136.57, samples=19
  lat (usec)   : 50=0.94%, 100=65.33%, 250=24.22%, 500=8.99%, 750=0.50%
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=7.09%, sys=92.89%, ctx=23, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1391741,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=544MiB/s (570MB/s), 544MiB/s-544MiB/s (570MB/s-570MB/s), io=5436MiB (5701MB), run=10001-10001msec

Disk stats (read/write):
  nvme0n1: ios=1369646/0, merge=0/0, ticks=155565/0, in_queue=17, util=99.00%

-----------------------------------------------------------------------------------

# fio -name iops -rw=read -bs=4k -runtime=60 -iodepth 32 -filename /dev/nvme0n1 -ioengine libaio -direct=1

# fio -name iops -rw=randrw -bs=4k -runtime=5 -iodepth 32 -filename /dev/nvme0n1 -ioengine libaio -direct=1

# fio -name iops -rw=randrw -bsrange=512-2048 -runtime=5 -iodepth 32 -filename /dev/nvme0n1 -ioengine libaio -direct=1

# fio -name iops -rw=randrw -bsrange=512-2048 -runtime=5 -iodepth 32 -numjobs=2 -filename /dev/nvme0n1 -ioengine libaio -direct=1

# fio -name iops -rw=randrw -bsrange=512-2048 -runtime=5 -iodepth 32 -numjobs=2 -filename /dev/nvme0n1 -ioengine libaio -direct=1 -size=2G

# fio -name iops -rw=randrw -bsrange=512-2048 -runtime=5 -iodepth 32 -numjobs=2 -filename /dev/nvme0n1 -ioengine libaio -direct=1 -size=2G -group_reporting


> rw: read, randrw, randwrite

> -group_reporting: do not display result for each 'numjobs'